# People Analytic Project - Colacho Company, Inc

## Salary Database

## 1. Import libraries

In [1]:
import pandas as pd
import numpy as np

## 2. Import our database

We are going to import our database and use it to create a new data frame for the salaries. We will use column names, surnames, work department, and ID. Also we will add some new columns too.

In [2]:
# Let's import our data frame
cdf_rawdata = pd.read_csv('colacho_database.csv')
cdf_rawdata

,Name,Surname,Gender,WorkDepartment,ID,Address,Birthday,Age
0,John,Smith,male,Sales,GC9893,0487 Hull Village Suite 759,2003-04-05,20
1,Emily,Johnson,female,Marketing,BI7199,242 Christine Glen,1965-02-24,58
2,Michael,Williams,male,Sales,GK9359,1157 Michael Island,1996-10-13,27
3,Sarah,Jones,female,Sales,JG6458,778 Brown Plaza,1995-11-26,28
4,David,Brown,male,Marketing,NW1028,60975 Jessica Squares,1957-08-30,66
...,...,...,...,...,...,...,...,...
95,Madelyn,Alexander,female,Account,AM4257,003 Alexander Shoal Suite 105,1957-11-26,66
96,Brayden,Russell,male,Sales,PP5330,37625 Thompson Isle Suite 606,1985-01-03,38
97,Elena,Griffin,female,Account,GW6266,870 Robert Loaf Apt. 082,1963-07-02,60
98,Oliver,Diaz,male,Sales,SU3775,53230 Julia Villages,1978-03-02,45
99,Anna,Hayes,female,Account,IA2241,169 Christine Mount,1955-07-28,68

### 2.1 Salaries data frame

It's time to create our new data frame for the employees salaries

In [3]:
# Create the new data frame in a new variable
cdf_salary = cdf_rawdata[['ID', 'Name', 'Surname', 'WorkDepartment']].copy()

# Checking if the data frame has the information needed
cdf_salary

        ID     Name    Surname WorkDepartment
0   GC9893     John      Smith          Sales
1   BI7199    Emily    Johnson      Marketing
2   GK9359  Michael   Williams          Sales
3   JG6458    Sarah      Jones          Sales
4   NW1028    David      Brown      Marketing
..     ...      ...        ...            ...
95  AM4257  Madelyn  Alexander        Account
96  PP5330  Brayden    Russell          Sales
97  GW6266    Elena    Griffin        Account
98  SU3775   Oliver       Diaz          Sales
99  IA2241     Anna      Hayes        Account

[100 rows x 4 columns]

### 2.2 Create the new columns

With the new data frame, now we can add the new columns, base salary, experience

#### 2.2.a Salary

In [4]:
# For this example we are not going to use a date to calculate the years the employees have in the company. 
# Instead, we will generate the number by using a random function

# Salaries
salary = np.random.randint(18000, 75000, size = 100)
cdf_salary['Salary'] = salary

cdf_salary

        ID     Name    Surname WorkDepartment  Salary
0   GC9893     John      Smith          Sales   71749
1   BI7199    Emily    Johnson      Marketing   44149
2   GK9359  Michael   Williams          Sales   28875
3   JG6458    Sarah      Jones          Sales   71388
4   NW1028    David      Brown      Marketing   33249
..     ...      ...        ...            ...     ...
95  AM4257  Madelyn  Alexander        Account   20159
96  PP5330  Brayden    Russell          Sales   67490
97  GW6266    Elena    Griffin        Account   34132
98  SU3775   Oliver       Diaz          Sales   57535
99  IA2241     Anna      Hayes        Account   65586

[100 rows x 5 columns]

#### 2.2.b Experience

In [7]:
# Create the random number generator
exp = np.random.uniform(0.5, 6, size=100)

# Function to round the numbers to 0 or 0.5
def round_num(arr):
    round_values = np.round(arr * 2 ) / 2
    return round_values


# Round our numbers into one decimal
exp_round = round_num(exp)

# Put the values into the column 'Experience'
cdf_salary['Experience'] = exp_round

# Check our data frame
cdf_salary

        ID     Name    Surname WorkDepartment  Salary  Experience
0   GC9893     John      Smith          Sales   71749         1.5
1   BI7199    Emily    Johnson      Marketing   44149         1.5
2   GK9359  Michael   Williams          Sales   28875         5.5
3   JG6458    Sarah      Jones          Sales   71388         5.5
4   NW1028    David      Brown      Marketing   33249         4.0
..     ...      ...        ...            ...     ...         ...
95  AM4257  Madelyn  Alexander        Account   20159         2.5
96  PP5330  Brayden    Russell          Sales   67490         0.5
97  GW6266    Elena    Griffin        Account   34132         3.0
98  SU3775   Oliver       Diaz          Sales   57535         5.5
99  IA2241     Anna      Hayes        Account   65586         3.5

[100 rows x 6 columns]